{
  "intents": [
    {
      "tag": "saludos",
      "patterns": [
        "hola",
        "buenos días",
        "buenas tardes",
        "saludos",
        "qué tal",
        "hola, cómo estás"
      ],
      "responses": [
        "Hola, ¿en qué puedo ayudarte?",
        "¡Hola! ¿Cómo te puedo asistir hoy?"
      ],
      "context": [""]
    },
    {
      "tag": "despedida",
      "patterns": ["adiós", "hasta luego", "nos vemos", "chau", "hasta pronto"],
      "responses": [
        "¡Que tengas un buen día! Vuelve cuando lo necesites.",
        "Adiós, gracias por comunicarte con nosotros."
      ],
      "context": [""]
    },
    {
      "tag": "agradecimiento",
      "patterns": [
        "gracias",
        "muchas gracias",
        "te lo agradezco",
        "muy amable",
        "eso me ayuda",
        "genial, gracias"
      ],
      "responses": [
        "¡Me alegra poder ayudarte!",
        "¡De nada! Estoy aquí para lo que necesites."
      ],
      "context": [""]
    },
    {
      "tag": "norespuesta",
      "patterns": [""],
      "responses": [
        "Lo siento, no entendí lo que dijiste.",
        "Por favor, bríndame más información.",
        "No estoy seguro de entender, ¿podrías reformular?"
      ],
      "context": [""]
    },
    {
      "tag": "nombre",
      "patterns": ["¿Cómo te llamas?", "¿Quién eres?", "¿Cuál es tu nombre?"],
      "responses": [
        "Soy tu asistente virtual del banco GalaBot. ¿En qué puedo ayudarte?",
        "Soy el chatbot GalaBot, aquí para asistirte."
      ],
      "context": [""]
    },
    {
      "tag": "miperfil",
      "patterns": ["mi nombre es ", "soy "],
      "responses": [
        "¡Encantado de conocerte {n}! ¿En qué puedo asistirte, {n}?"
      ],
      "context": [""]
    },
    {
      "tag": "miperfilgenerico",
      "patterns": ["me llamo ", "me llaman "],
      "responses": ["¡Encantado de conocerte! ¿En qué puedo asistirte?"],
      "context": [""]
    },
    {
      "tag": "estadocuenta",
      "patterns": [
        "¿Cuál es mi saldo?",
        "Quiero saber mi estado de cuenta",
        "¿Puedo consultar mi saldo?",
        "¿Cuánto dinero tengo?"
      ],
      "responses": [
        "Para acceder al estado de tu cuenta, inicia sesión en nuestra aplicación móvil o en la página web. Una vez dentro, dirígete a la sección 'Mis Cuentas' o 'Saldo'. Aquí podrás ver el saldo actual de todas tus cuentas asociadas, así como el historial de transacciones recientes. También podrás descargar un extracto detallado en formato PDF. La pantalla te mostrará el saldo disponible, el saldo total, y las transacciones más recientes organizadas por fecha."
      ],
      "context": [""]
    },
    {
      "tag": "abrircuenta",
      "patterns": [
        "Quiero abrir una cuenta",
        "¿Cómo puedo abrir una cuenta?",
        "Abrir una cuenta bancaria",
        "¿Puedo abrir una cuenta?"
      ],
      "responses": [
        "Para abrir una cuenta, accede a nuestra página web o aplicación móvil. Dirígete a la sección 'Cuentas' y selecciona 'Abrir nueva cuenta'. Completa el formulario con tus datos personales, como nombre completo, dirección, número de identificación oficial (DNI o pasaporte), correo electrónico, y número de teléfono. También deberás proporcionar información financiera básica y elegir el tipo de cuenta que deseas (ahorros, corriente, etc.). Una vez enviada la solicitud, te notificaremos sobre el estado de la apertura de tu cuenta."
      ],
      "context": [""]
    },
    {
      "tag": "cancelarcuenta",
      "patterns": [
        "Quiero cancelar mi cuenta",
        "¿Cómo cancelo mi cuenta?",
        "Cerrar mi cuenta",
        "¿Puedo dar de baja mi cuenta?"
      ],
      "responses": [
        "Para cancelar tu cuenta, accede a tu perfil en nuestra aplicación móvil o página web. Ve a la sección 'Configuración' y selecciona la opción 'Cerrar Cuenta'. Se te pedirá que confirmes la solicitud y proporciones una razón para la cancelación. Después de verificar tus datos, el sistema te mostrará un resumen del proceso, y recibirás una confirmación por correo electrónico. Ten en cuenta que debes liquidar cualquier saldo pendiente antes de cerrar la cuenta."
      ],
      "context": [""]
    },
    {
      "tag": "tarjetacredito",
      "patterns": [
        "Quiero una tarjeta de crédito",
        "¿Cómo solicito una tarjeta de crédito?",
        "Solicitar tarjeta de crédito"
      ],
      "responses": [
        "Para solicitar una tarjeta de crédito, inicia sesión en tu cuenta desde nuestra aplicación móvil o sitio web. Accede al menú principal y selecciona la opción 'Tarjetas'. Ahí podrás ver las diferentes opciones de tarjetas de crédito que ofrecemos, como tarjetas estándar, tarjetas premium o con beneficios especiales. Selecciona el tipo de tarjeta que deseas, revisa los requisitos y beneficios asociados, completa el formulario de solicitud con tu información personal, y envía la solicitud. Recibirás una respuesta sobre la aprobación en pocos días."
      ],
      "context": [""]
    },
    {
      "tag": "prestamo",
      "patterns": [
        "Quiero solicitar un préstamo",
        "¿Cómo solicito un préstamo?",
        "Solicitar préstamo",
        "¿Qué necesito para un préstamo?"
      ],
      "responses": [
        "Para solicitar un préstamo, inicia sesión en tu cuenta a través de nuestra aplicación móvil o sitio web. Luego, dirígete a la sección 'Préstamos' desde el menú principal. Ahí podrás elegir el tipo de préstamo que necesitas, completar el formulario de solicitud con tus datos personales, y enviar la solicitud para su evaluación. También podrás ver los requisitos y tasas de interés antes de confirmar la solicitud."
      ],
      "context": [""]
    },
    {
      "tag": "ubicacionsucursales",
      "patterns": [
        "¿Dónde está la sucursal más cercana?",
        "Ubicación de sucursales",
        "¿Dónde puedo encontrar una sucursal?",
        "Sucursales cercanas",
        "¿Cómo encuentro una sucursal?"
      ],
      "responses": [
        "Puedes encontrar la sucursal más cercana en nuestra página web seleccionando 'Sucursales' en el menú principal, ingresando tu ubicación o permitiendo la geolocalización, o en nuestra aplicación móvil seleccionando 'Sucursales', donde verás un mapa con los detalles de las sucursales cercanas, incluyendo horarios y teléfonos."
      ],
      "context": [""]
    },
    {
      "tag": "horariosatencion",
      "patterns": [
        "¿Cuáles son los horarios de atención?",
        "Horarios del banco",
        "¿A qué hora abren?",
        "¿Cuándo puedo ir al banco?"
      ],
      "responses": [
        "Nuestro horario de atención es de lunes a viernes de 9:00 a 16:00. Para más detalles, visita nuestra página web o comunícate con tu sucursal."
      ],
      "context": [""]
    },
    {
      "tag": "cambiocontraseña",
      "patterns": [
        "¿Cómo cambio mi contraseña?",
        "Cambiar contraseña",
        "Olvidé mi contraseña",
        "¿Puedo cambiar mi clave?"
      ],
      "responses": [
        "Puedes cambiar tu contraseña accediendo a tu cuenta en nuestra aplicación móvil o sitio web, luego selecciona 'Configuración' o 'Seguridad', busca la opción 'Cambiar contraseña', sigue las instrucciones y recibirás un correo de confirmación para completar el proceso."
      ],
      "context": [""]
    },
    {
      "tag": "ayuda",
      "patterns": [
        "Necesito ayuda",
        "¿Puedes ayudarme?",
        "Tengo una pregunta",
        "Consulta",
        "Asistencia"
      ],
      "responses": ["Claro, estoy aquí para ayudarte. ¿Qué necesitas saber?"],
      "context": [""]
    }
  ]
}
